Docs/Reference/Content/images/dependencies/net9.0/d2/alloverit-entityframeworkcore-diagrams.d2
direction: left

aoi: AllOverIt
aoi.alloverit-entityframeworkcore-diagrams: AllOverIt.EntityFrameworkCore.Diagrams
microsoft-entityframeworkcore-relational_9-0-17: Microsoft.EntityFrameworkCore.Relational\nv9.0.17
microsoft-entityframeworkcore_9-0-17: Microsoft.EntityFrameworkCore\nv9.0.17
microsoft-extensions-caching-memory_9-0-17: Microsoft.Extensions.Caching.Memory\nv9.0.17
microsoft-extensions-configuration-abstractions_9-0-17: Microsoft.Extensions.Configuration.Abstractions\nv9.0.17
microsoft-extensions-logging_9-0-17: Microsoft.Extensions.Logging\nv9.0.17
aoi.alloverit: AllOverIt
aoi.alloverit-assertion: AllOverIt.Assertion
microsoft-entityframeworkcore-relational_9-0-17 <- aoi.alloverit-entityframeworkcore-diagrams
microsoft-entityframeworkcore_9-0-17 <- microsoft-entityframeworkcore-relational_9-0-17
microsoft-extensions-caching-memory_9-0-17 <- microsoft-entityframeworkcore-relational_9-0-17
microsoft-extensions-configuration-abstractions_9-0-17 <- microsoft-entityframeworkcore-relational_9-0-17
microsoft-extensions-logging_9-0-17 <- microsoft-entityframeworkcore-relational_9-0-17
aoi.alloverit <- aoi.alloverit-entityframeworkcore-diagrams
aoi.alloverit-assertion <- aoi.alloverit
microsoft-entityframeworkcore-relational_9-0-17.style.fill: "#ADD8E6"
microsoft-entityframeworkcore-relational_9-0-17.style.opacity: 0.8
microsoft-entityframeworkcore_9-0-17.style.fill: "#FFEC96"
microsoft-entityframeworkcore_9-0-17.style.opacity: 0.8
microsoft-extensions-caching-memory_9-0-17.style.fill: "#FFEC96"
microsoft-extensions-caching-memory_9-0-17.style.opacity: 0.8
microsoft-extensions-configuration-abstractions_9-0-17.style.fill: "#FFEC96"
microsoft-extensions-configuration-abstractions_9-0-17.style.opacity: 0.8
microsoft-extensions-logging_9-0-17.style.fill: "#FFEC96"
microsoft-extensions-logging_9-0-17.style.opacity: 0.8
aoi.style.fill: "#E7EBFC"
aoi.style.opacity: 1
